In [3]:
import pandas as pd
import numpy as np

In [11]:
#creating dataframe

df=pd.DataFrame(np.arange(0,20).reshape(4,5),index=['R1','R2','R3','R4'],columns=['c1','c2','c3','c4','c5'])

In [5]:
df.head()

    c1  c2  c3  c4  c5
R1   0   1   2   3   4
R2   5   6   7   8   9
R3  10  11  12  13  14
R4  15  16  17  18  19

In [6]:
#creating csv
df.to_csv('Test1.csv')

In [9]:
#accesing
#1.loc 
#2.iloc
df.loc['R1']

c1    0
c2    1
c3    2
c4    3
c5    4
Name: R1, dtype: int64

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
type(df.loc['R1'])

pandas.core.series.Series

In [54]:
df['c1']

R1     0
R2     5
R3    10
R4    15
Name: c1, dtype: int64

In [24]:
#create series
s1 = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])

In [25]:
s1

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [26]:
type(s1)

pandas.core.series.Series

In [27]:
#create series with numpy
s2=pd.Series(np.arange(5))

In [28]:
s2

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [29]:
type(s2)

pandas.core.series.Series

In [30]:
df

    c1  c2  c3  c4  c5
R1   0   1   2   3   4
R2   5   6   7   8   9
R3  10  11  12  13  14
R4  15  16  17  18  19

In [31]:
df.loc['R1']

c1    0
c2    1
c3    2
c4    3
c5    4
Name: R1, dtype: int64

In [33]:
df.iloc[:,:] #all rows and all colmns

    c1  c2  c3  c4  c5
R1   0   1   2   3   4
R2   5   6   7   8   9
R3  10  11  12  13  14
R4  15  16  17  18  19

In [36]:
df.iloc[:2,:2]

    c1  c2
R1   0   1
R2   5   6

In [41]:
#dataframes into arrays
df.iloc[:,:].values

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [44]:
df.isnull().sum()

c1    0
c2    0
c3    0
c4    0
c5    0
dtype: int64

In [12]:
df["c1"].value_counts()

c1
0     1
5     1
10    1
15    1
Name: count, dtype: int64

In [13]:
df["c1"].unique()

array([ 0,  5, 10, 15])

In [14]:
df['c1']

R1     0
R2     5
R3    10
R4    15
Name: c1, dtype: int64

In [24]:
df.loc['R1']

c1    0
c2    1
c3    2
c4    3
c5    4
Name: R1, dtype: int64

In [26]:
df=pd.read_csv('mercedesbenz.csv');

In [29]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [36]:
df['X0']

0        k
1        k
2       az
3       az
4       az
        ..
4204    ak
4205     j
4206    ak
4207    al
4208     z
Name: X0, Length: 4209, dtype: object

In [38]:
df['X0'].value_counts() #value counts

X0
z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
aq     18
i      18
am     18
u      17
aw     16
l      16
ad     14
k      11
au     11
b      11
r      10
as     10
bc      6
ao      4
c       3
q       2
aa      2
ac      1
g       1
ab      1
Name: count, dtype: int64

In [45]:
df[df['y']>160]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
342,681,169.91,aa,l,ak,f,d,i,c,d,...,0,0,0,0,0,0,0,0,0,0
883,1770,265.32,y,r,ai,f,d,ag,l,t,...,0,0,0,0,0,0,0,0,0,0
1203,2396,160.87,j,o,as,f,d,ab,g,p,...,1,0,0,0,0,0,0,0,0,0
1459,2903,167.45,ai,b,ae,a,d,ac,g,m,...,0,0,1,0,0,0,0,0,0,0
3133,6273,165.52,aj,v,r,c,d,q,g,a,...,0,0,1,0,0,0,0,0,0,0

In [47]:
from io import StringIO,BytesIO

In [50]:
data=('col1,col2,col3\n'
         'x,y,1\n'
        'a,b,2\n'
         'c,d,3')

In [51]:
type(data)

str

In [53]:
StringIO()

In [55]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [56]:
#retriving required columns from csv
df=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [57]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [58]:
df.to_csv('Testsss.csv');

In [59]:
data=('a,b,c,d\n'
         '1,2,3,4\n'
        '5,6,7,8\n'
         '9,10,11,12')

In [60]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [66]:
df=pd.read_csv(StringIO(data),dtype=float) # change to diff dtype

In [67]:
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [68]:
df['a']

0    1.0
1    5.0
2    9.0
Name: a, dtype: float64

In [73]:
import numpy as np
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'a':object})

In [74]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [75]:
df.dtypes

a     object
b      int64
c    float64
d      int64
dtype: object

In [76]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [109]:
data=('index,a,b,c\n'
         '101,man,3\n'
        '102,sat,7\n'
         '109,on,11')

In [111]:
#setting index
pd.read_csv(StringIO(data))

   index    a   b   c
0    101  man   3 NaN
1    102  sat   7 NaN
2    109   on  11 NaN

In [112]:
pd.read_csv(StringIO(data),index_col=0)

         a   b   c
index
101    man   3 NaN
102    sat   7 NaN
109     on  11 NaN

In [113]:
data='a,b\n"hello, \\"Bob\\",nice to do ok",25'

In [115]:
pd.read_csv(StringIO(data),escapechar='\\')

                            a   b
0  hello, "Bob",nice to do ok  25

In [117]:
#url to csv
df=pd.read_csv('url',sep='\t')